In [1]:
import antigravity

In [2]:
import pandas as pd

In [3]:
surveys_df = pd.read_csv("surveys.csv")
type(surveys_df)

pandas.core.frame.DataFrame

In [4]:
surveys_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35549 entries, 0 to 35548
Data columns (total 9 columns):
record_id          35549 non-null int64
month              35549 non-null int64
day                35549 non-null int64
year               35549 non-null int64
plot_id            35549 non-null int64
species_id         34786 non-null object
sex                33038 non-null object
hindfoot_length    31438 non-null float64
weight             32283 non-null float64
dtypes: float64(2), int64(5), object(2)
memory usage: 2.4+ MB

In [5]:
surveys_df.head()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN

In [6]:
surveys_df.head(2)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN

In [7]:
surveys_df.tail(3)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

In [8]:
surveys_df.sample(3)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
19284,19285,11,14,1991,11,AH,NaN,NaN,NaN
9173,9174,5,13,1984,4,DS,F,49.0,120.0
33109,33110,11,17,2001,23,AH,NaN,NaN,NaN

In [9]:
surveys_df['species_id'].head(3)

0    NL
1    NL
2    DM
Name: species_id, dtype: object

In [10]:
surveys_df[['year','month','day']].sample(3)

       year  month  day
19235  1991     11   13
29547  1999      4   18
11220  1985     12    8

In [11]:
surveys_df[["record_id","plot_id"]].tail(4)

       record_id  plot_id
35545      35546       15
35546      35547       10
35547      35548        7
35548      35549        5

In [12]:
surveys_df['year'] > 2000

0        False
1        False
2        False
3        False
4        False
         ...
35544     True
35545     True
35546     True
35547     True
35548     True
Name: year, Length: 35549, dtype: bool

In [13]:
surveys_df[surveys_df['year'] > 2000].head()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
31710,31711,1,21,2001,1,PB,F,26.0,25.0
31711,31712,1,21,2001,1,DM,M,37.0,43.0
31712,31713,1,21,2001,1,PB,M,29.0,44.0
31713,31714,1,21,2001,1,DO,M,34.0,53.0
31714,31715,1,21,2001,2,OT,M,20.0,27.0

In [14]:
recent_values = surveys_df[surveys_df['year'] > 2000]
len(recent_values)

3839

In [15]:
len("Hola mundo")

10

In [16]:
surveys_df[surveys_df['year'] > 2000]['plot_id'].sample(5)

35021    19
33593    12
35474    22
32324     8
32687     7
Name: plot_id, dtype: int64

In [17]:
recent_values['plot_id'].sample(5)

34518    23
34046     7
34306     4
32114     9
34681    18
Name: plot_id, dtype: int64

In [18]:
surveys_df.sort_values('weight').head(5)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
9908,9909,1,20,1985,15,RM,F,15.0,4.0
4289,4290,4,6,1981,4,PF,NaN,NaN,4.0
9793,9794,1,19,1985,24,RM,M,16.0,4.0
9789,9790,1,19,1985,16,RM,F,16.0,4.0
5345,5346,2,22,1982,21,PF,F,14.0,4.0

In [19]:
surveys_df.sort_values('weight', ascending=False).head(3)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
33048,33049,11,17,2001,12,NL,M,33.0,280.0
12870,12871,5,28,1987,2,NL,M,32.0,278.0
15458,15459,1,11,1989,9,NL,M,36.0,275.0

In [22]:
surveys_df[surveys_df["sex"] == "F"].sort_values('hindfoot_length', ascending=False)[['species_id','hindfoot_length']].head(3)

      species_id  hindfoot_length
30424         DO             64.0
1693          DS             58.0
4448          DS             57.0

Here is where we're answering the challenge question.
This is how to break up a long command into several pieces.

In [24]:
#Here is the same thing, but as a comment.
females = surveys_df[surveys_df['sex'] == 'F']
(females
    .sort_values('hindfoot_length',
                    ascending=False)
    .head(3))

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
30424,30425,3,4,2000,1,DO,F,64.0,35.0
1693,1694,3,31,1979,8,DS,F,58.0,123.0
4448,4449,5,4,1981,2,DS,F,57.0,136.0